---
kind: method
id: M:Autodesk.Revit.DB.Structure.ConnectionInputPoint.Dispose
source: html/daec1c72-1aa6-8b45-6616-6c1a339841a4.htm
---
# Autodesk.Revit.DB.Structure.ConnectionInputPoint.Dispose Method

Releases all resources used by the ConnectionInputPoint

## Syntax (C#)
```csharp
public void Dispose()
```